# USA Car Sales Report

# Table Contents

## 1. Import Libraries
## 2. Import Data
## 3. Data Cleaning
        -Check missing value
        -Check duplicates
        -Check mixed data type
## 4. Data Wrangling
        -Drop irrelevant columns
        -Replace column
## 5. Export Data

## 1. Import Libraries

In [48]:
import pandas as pd
import numpy as np
import os

## 2. Import Data

In [65]:
path = r'/Users/brianyoo/Downloads/CF'

In [66]:
df = pd.read_csv(os.path.join(path, 'Task 6.1', 'USA_cars_datasets.csv'))

In [67]:
df.head()

,Unnamed: 0,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,1,2899,ford,se,2011,clean vehicle,190552.0,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,3,25000,ford,door,2014,clean vehicle,64146.0,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [68]:
# Checking shape of data frame
df.shape

(2499, 13)

In [69]:
# Checking each column's info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2499 entries, 0 to 2498
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    2499 non-null   int64
 1   price         2499 non-null   int64
 2   brand         2499 non-null   object
 3   model         2499 non-null   object
 4   year          2499 non-null   int64
 5   title_status  2499 non-null   object
 6   mileage       2499 non-null   float64
 7   color         2499 non-null   object
 8   vin           2499 non-null   object
 9   lot           2499 non-null   int64
 10  state         2499 non-null   object
 11  country       2499 non-null   object
 12  condition     2499 non-null   object
dtypes: float64(1), int64(4), object(8)
memory usage: 253.9+ KB

In [70]:
df.describe()

        Unnamed: 0         price         year       mileage           lot
count  2499.000000   2499.000000  2499.000000  2.499000e+03  2.499000e+03
mean   1249.000000  18767.671469  2016.714286  5.229869e+04  1.676914e+08
std     721.543484  12116.094936     3.442656  5.970552e+04  2.038772e+05
min       0.000000      0.000000  1973.000000  0.000000e+00  1.593488e+08
25%     624.500000  10200.000000  2016.000000  2.146650e+04  1.676253e+08
50%    1249.000000  16900.000000  2018.000000  3.536500e+04  1.677451e+08
75%    1873.500000  25555.500000  2019.000000  6.347250e+04  1.677798e+08
max    2498.000000  84900.000000  2020.000000  1.017936e+06  1.678055e+08

## 3. Data Cleaning

In [75]:
# Check for mixed data type
for col in df_clean.columns.tolist():
  weird = (df_clean[[col]].applymap(type) != df_clean[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_clean[weird]) > 0:
    print (col)

In [76]:
# Dropping 'price' value with 0
dff = df.drop(df.loc[df['price'] == df['price'].min()].index)

In [77]:
# Check for duplicates
df_clean_dup = df_clean[df_clean.duplicated()]

In [78]:
# Duplicates were not found
df_clean_dup

Empty DataFrame
Columns: [price, brand, model, year, title_status, mileage, color, state, condition]
Index: []

## 4. Data Wrangling

In [79]:
# Dropping irrelevant columns for analysis
df_clean = dff.drop(['vin','lot','Unnamed: 0', 'country'],axis = 1)

In [80]:
# Check for the shape of cleaned data frame
df_clean.shape

(2456, 9)

In [81]:
# Min value of price was changed
df_clean.describe()

              price         year       mileage
count   2456.000000  2456.000000  2.456000e+03
mean   19096.258550  2016.931189  5.011143e+04
std    11962.176006     2.957497  5.460446e+04
min       25.000000  1973.000000  0.000000e+00
25%    10500.000000  2016.000000  2.127675e+04
50%    17050.000000  2018.000000  3.504850e+04
75%    25800.000000  2019.000000  6.005075e+04
max    84900.000000  2020.000000  1.017936e+06

In [82]:
# Replaced 'condition' column by delething 'left'
df_clean.replace({'condition': r' left$'}, {'condition': ''}, regex = True,inplace = True)

In [64]:
df_clean.head(5)

,price,brand,model,year,title_status,mileage,color,state,condition
0,6300,toyota,cruiser,2008,clean vehicle,274117.0,black,new jersey,10 days
1,2899,ford,se,2011,clean vehicle,190552.0,silver,tennessee,6 days
2,5350,dodge,mpv,2018,clean vehicle,39590.0,silver,georgia,2 days
3,25000,ford,door,2014,clean vehicle,64146.0,blue,virginia,22 hours
4,27700,chevrolet,1500,2018,clean vehicle,6654.0,red,florida,22 hours

## 5. Export Data

In [84]:
df_clean.to_csv(os.path.join(path, 'Task 6.1', 'USA_cars_datasets.csv'))